#Задание 1.5 9.30 Деление амёбы
X=int(input('Введите количество амёб>>'))
a=1
v=0
while a<X:
    a=a*2
    v+=3
print(a, 'амёб, получится через', v, 'часов.')
