#Задание 1.5 26 Вывести на экран фамилию
for i in range (10):
    print('Артём Шестаков')
