#Задание 1.3 9
print('Лотерейные билеты')
from random import randint
print('Для молодёжи', randint(1, 100))
print('Для взрослых', randint(101, 200))
print('Для пенсионеров', randint(201, 250))
