#Задание 1.3 21б
a=int(input('Введите сторону А>>'))
b=int(input('Введите сторону B>>'))
c=int(input('Введите сторону C>>'))
rez=not((a==b)or(a==c)or(b==c))
print(rez)
