#Задание 1.3 18
s=input('Введите строку: ')
print('Длинна строки:', len(s))
