#Задание 1.3 6
print('Вычисление точной суммы налога')
a=float(input('Введите сумму>>'))
print('Точная сумма налога = ', round(a))
