#Задание 1.5 27 Нарисовать шахматную доску
for i in range (4):
    print('*  *  *  *  *')
    print(' *  *  *  *  ')
