#Задание 1.5 30.32 Нахождение проихведения двух чисел используя for
z=0
x, y=map(int,input('Введите два натуральных числа через пробел>>').split())
for i in range(y): z=z+x
print(z)
